Revit 2027 API
ExternalServices.BuiltInExternalServices.PipeFittingAndAccessoryPressureDropUIService Property
 The external service which permits registration of an alternate implementation for a pipe fitting and accessory pressure drop calculation UI. To use this service, programmers implement a server class that derives from IPipeFittingAndAccessoryPressureDropUIServer.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId PipeFittingAndAccessoryPressureDropUIService { get; }
Public Shared ReadOnly Property PipeFittingAndAccessoryPressureDropUIService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ PipeFittingAndAccessoryPressureDropUIService {
	ExternalServiceId^ get ();
}
static member PipeFittingAndAccessoryPressureDropUIService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace